Autodesk.Revit.DB.Structure.RebarHandleBehavior
Different behaviors that can be applied to a RebarConstrainedHandle.
Depending on the behavior, the RebarConstrainedHandle plane is situated in a different location
All the data in constraints for a RebarConstrainedHandle with a specific behavior are relative to this plane.
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceEdge
The behavior can be set to an edge segment that is connected to the other rebar of splice.
The plane of a RebarConstrainedHandle with behavior is the same as the default one.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the edge segment of the bar that is part of splice and don't have a ToOtherRebar constraint
to another bar in chain.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceOutOfPlaneExtentOnSpliceSetExtent
The behavior can be set to a OutOfPlaneExtent RebarConstrainedHandle of a bar that is part of splice.
If we are looking at the extents of the entire set this RebarConstrainedHandle's plane is exactly on the set extents.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the OutOfPlaneExtent RebarConstrainedHandle of the first bar in splice chain (all relevant data
are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceRebarPlaneOnSpliceSetExtent
The behavior can be set to a RebarPlane RebarConstrainedHandle of a bar that is part of splice.
If we are looking at the extents of the entire set this RebarConstrainedHandle's plane is exactly on the set extents.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarPlane RebarConstrainedHandle of the first bar in splice chain (all relevant data
are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceConnectedEndOnEnd2Position
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On this RebarConstrainedHandle is a ToOtherRebar constraint whose target is the other bar involved in splice
The RebarConstrainedHandle's plane in the same position as the splice plane for End2. It is located at a (lapLength + staggerLength) distance from the other bar's end that is involved in splice.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarConstrainedHandle that represent the other bar's end that is involved in splice (all relevant data
are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceConnectedEndOnMiddlePosition
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On this RebarConstrainedHandle is a ToOtherRebar constraint whose target is the other bar involved in splice
The RebarConstrainedHandle's plane in the same position as the splice plane for Middle. It is located at a (lapLength + staggerLength)/2 distance from the other bar's end that is involved in splice.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarConstrainedHandle that represent the other bar's end that is involved in splice (all relevant data
are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceConnectedEndOnEnd1Position
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On this RebarConstrainedHandle is a ToOtherRebar constraint whose target is the other bar involved in splice
The RebarConstrainedHandle's plane in the same position as the splice plane for End1. It is located on the other bar's end that is involved in splice.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarConstrainedHandle that represent the other bar's end that is involved in splice (all relevant data
are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceMainEndOnEnd2Position
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On the connected bar there is a ToOtherRebar constraint whose target is the current rebar.
The RebarConstrainedHandle's plane in the same position as the splice plane for End2. It is located at a (lapLength + staggerLength)/2 distance from the RebarConstrainedHandle with the default behavior.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarConstrainedHandle with default behaviour (all relevant data are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceMainEndOnMiddlePosition
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On the connected bar there is a ToOtherRebar constraint whose target is the current rebar.
The RebarConstrainedHandle's plane in the same position as the splice plane for Middle. It is located at a (lapLength + staggerLength)/2 distance from the RebarConstrainedHandle with the default behavior.
If a constraint for a handle with this behavior is set as preferred, it will be set a constraint for the RebarConstrainedHandle with default behaviour (all relevant data are changed so that the offset is kept).

Autodesk.Revit.DB.Structure.RebarHandleBehavior.SpliceMainEndOnEnd1Position
The behavior can be set to a StartOfBar or EndOfBar RebarConstrainedHandle of a bar that is part of splice. On the connected bar there is a ToOtherRebar constraint whose target is the current rebar.
The RebarConstrainedHandle's plane in the same position as the splice plane for End1. It goes through the bar's end.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.Default
Represents the default behavior of a RebarConstrainedHandle.